[
  {
    "id": "3852b90731eabdcf65ce049c785f2b9b",
    "title": "Putin-Zelenskyy meet agreed: White House announces Putin ready for bilateral meet; trilateral talks an option 'if necessary'",
    "description": "US News: The White House confirms a bilateral meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy, aimed at advancing the peace process. Trilateral talks involving President Trump are also a possibility. Find out more about the ongoing diplomatic efforts.",
    "content": "White House announces Putin ready for bilateral meet\nWhite House press secretary Karoline Leavitt announced on Tuesday that Russian President Vladimir Putin agreed to hold a bilateral meeting with Ukrainian President Volodymyr Zelenskyy Leavitt said,... [1144 chars]",
    "url": "https://timesofindia.indiatimes.com/world/us/putin-zelenskyy-meet-agreed-white-house-announces-putin-ready-for-bilateral-meet-trilateral-talks-an-option-if-necessary/articleshow/123397961.cms",
    "image": "https://static.toiimg.com/thumb/msid-123398161,width-1070,height-580,imgsize-898961,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "publishedAt": "2025-08-20T03:16:00Z",
    "lang": "en",
    "source": {
      "id": "9a9a0fb79c70bbf499d39baca94921ae",
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com",
      "country": "in"
    }
  },
  {
    "id": "fb361057401d576e0ccf45014d256537",
    "title": "Peace push: US eyes Budapest for Donald Trump-Putin-Zelenskyy meet; Russia signals gradual approach",
    "description": "Europe News: The White House is reportedly considering Budapest for a high-stakes trilateral meeting between Presidents Trump, Putin, and Zelenskyy. While the US S",
    "content": "File photo: Russian President Vladimir Putin, US President Donald Trump and Ukrainian President Zelenskyy (Picture credit: AP)\nThe White House is considering Budapest as the potential venue for a high-stakes trilateral meeting between US President Do... [3362 chars]",
    "url": "https://timesofindia.indiatimes.com/world/europe/peace-push-us-eyes-budapest-for-donald-trump-putin-zelenskyy-meet-russia-signals-gradual-approach/articleshow/123398186.cms",
    "image": "https://static.toiimg.com/thumb/msid-123397671,width-1070,height-580,imgsize-840582,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "publishedAt": "2025-08-20T02:41:00Z",
    "lang": "en",
    "source": {
      "id": "9a9a0fb79c70bbf499d39baca94921ae",
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com",
      "country": "in"
    }
  },
  {
    "id": "b7124993cbd90b1be5240e7503dac338",
    "title": "Peace push: US eyes Budapest for Donald Trump-Putin-Zelenskyy meet; Russia signals gradual approach",
    "description": "US News: The White House is reportedly considering Budapest for a high-stakes trilateral meeting between Presidents Trump, Putin, and Zelenskyy. While the US S",
    "content": "File photo: Russian President Vladimir Putin, US President Donald Trump and Ukrainian President Zelenskyy (Picture credit: AP)\nThe White House is considering Budapest as the potential venue for a high-stakes trilateral meeting between US President Do... [3361 chars]",
    "url": "https://timesofindia.indiatimes.com/world/us/peace-push-us-eyes-budapest-for-donald-trump-putin-zelenskyy-meet-russia-signals-gradual-approach/articleshow/123397580.cms",
    "image": "https://static.toiimg.com/thumb/msid-123397671,width-1070,height-580,imgsize-840582,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg",
    "publishedAt": "2025-08-20T02:41:00Z",
    "lang": "en",
    "source": {
      "id": "9a9a0fb79c70bbf499d39baca94921ae",
      "name": "Times of India",
      "url": "https://timesofindia.indiatimes.com",
      "country": "in"
    }
  },
  {
    "id": "5a7c7b1538d9e51db2c6990c4c0e48e3",
    "title": "Trump’s Jaw-Dropping Ignorance Exposed During Putin Meet: Author",
    "description": "In the Daily Beast podcast Inside Trump’s Head, author Michael Wolff says the president’s comments left Marco Rubio and Steve Witkoff “basically helpless.”",
    "content": "Donald Trump displayed a stunning ignorance of the Cold War during last week’s summit with Russian President Vladimir Putin, according to his biographer.\nAuthor Michael Wolff told the Daily Beast podcast Inside Trump’s Head on Tuesday that, in the pr... [3601 chars]",
    "url": "https://www.thedailybeast.com/trumps-jaw-dropping-ignorance-exposed-during-putin-meet-author/",
    "image": "https://www.thedailybeast.com/resizer/v2/V43H4ENTEBFX3LYHXOLXFNCXFY.jpg?smart=true&auth=d1d49f3f91df2a4be8056efae9b9b8bacf8c1af452b9c4ade5522b166cac0cc6&width=1200&height=630",
    "publishedAt": "2025-08-20T01:42:34Z",
    "lang": "en",
    "source": {
      "id": "dd4c720b98e562405eba2c628af5bfd0",
      "name": "The Daily Beast",
      "url": "https://www.thedailybeast.com",
      "country": "us"
    }
  },
  {
    "id": "6d859143bad5d4a37ec02582c2856fb4",
    "title": "Putin ‘won’t give up on trying to destroy’ us, Ukraine’s former foreign minister warns",
    "description": "The White House says that Vladimir Putin told President Trump that he would meet with the man whose country Russia invaded, Ukrainian President Volodymyr Zelenskyy. It comes as Trump is ruling out sending U.S. troops to Ukraine and also signaling it would be impossible for Ukraine to get Crimea back. Nick Schifrin discussed more with Pavlo Klimkin, Ukraine’s foreign minister from 2014 to 2019.",
    "content": "Nick Schifrin:\nBesides ruling out sending U.S. troops to Ukraine, President Trump also said it would be impossible for Ukraine to get Crimea back.\nFor a perspective on all the recent diplomatic meetings aiming to end the war in Ukraine, we turn to Pa... [471 chars]",
    "url": "https://www.pbs.org/newshour/show/putin-wont-give-up-on-trying-to-destroy-us-ukraines-former-foreign-minister-warns",
    "image": "https://d3i6fh83elv35t.cloudfront.net/static/2025/08/FutureofUkraine-4-1024x683.jpg",
    "publishedAt": "2025-08-19T22:55:38Z",
    "lang": "en",
    "source": {
      "id": "31177620c1e6e610b5d2b67916ed3615",
      "name": "PBS News",
      "url": "https://www.pbs.org/newshour",
      "country": "us"
    }
  },
  {
    "id": "0d5290ba7e40abb8d292f3e8f41aef01",
    "title": "Trump can 'crush' Russia economy if Putin avoids Ukraine talks: Graham",
    "description": "President Donald Trump is willing to “crush” Russia's economy with sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Volodymyr Zelenskyy.",
    "content": "WASHINGTON (AP) — Republican Sen. Lindsey Graham said Tuesday that he believes President Donald Trump is prepared to “crush” Russia’s economy with a new wave of sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Vo... [3652 chars]",
    "url": "https://apnews.com/article/russia-sanctions-ukraine-trump-zelenskyy-war-negotiations-d94711651ab5b96f7b771c1fb3af1179",
    "image": "https://dims.apnews.com/dims4/default/5547f57/2147483647/strip/true/crop/3297x1855+0+172/resize/1440x810!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Ffc%2F77%2Fb3da6e90c7db98df5a72c0b4df9f%2F4b7e294b622c45c985fb07e9e13029fa",
    "publishedAt": "2025-08-19T22:20:50Z",
    "lang": "en",
    "source": {
      "id": "20ca9773b4c0563e26b4c2863bdf8c19",
      "name": "The Associated Press",
      "url": "https://apnews.com",
      "country": "us"
    }
  },
  {
    "id": "0203a2257e8d1be9b4a6444ba3b3e8ad",
    "title": "Sen. Lindsey Graham says Trump ready to ‘crush’ Russian economy if Putin avoids talks with Zelenskyy",
    "description": "President Donald Trump is willing to “crush” Russia's economy with sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Volodymyr Zelenskyy.",
    "content": "WASHINGTON – Republican Sen. Lindsey Graham said Tuesday that he believes President Donald Trump is prepared to “crush” Russia’s economy with a new wave of sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Volodym... [3666 chars]",
    "url": "https://www.clickondetroit.com/news/politics/2025/08/19/sen-lindsey-graham-says-trump-ready-to-crush-russian-economy-if-putin-avoids-talks-with-zelenskyy/",
    "image": "https://res.cloudinary.com/graham-media-group/image/upload/f_auto/q_auto/c_thumb,w_700/v1/media/gmg/UVPXYNO3ZVBYXMAAAXV5XCEWVI.jpg?_a=DATAg1eAZAA0",
    "publishedAt": "2025-08-19T22:20:50Z",
    "lang": "en",
    "source": {
      "id": "35515662ec044d3f94b543cd8802d63f",
      "name": "WDIV ClickOnDetroit",
      "url": "https://www.clickondetroit.com",
      "country": "us"
    }
  },
  {
    "id": "6cc132cada0fd10fa8a71bc8c217f72e",
    "title": "Sen. Lindsey Graham Says Trump Ready to ‘Crush’ Russian Economy if Putin Avoids Talks With Zelenskyy",
    "description": "WASHINGTON (AP) — Republican Sen. Lindsey Graham said Tuesday that he believes President Donald Trump is prepared to “crush” Russia’s economy with a new wave of sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Volodymyr Zelenskyy in the coming weeks.",
    "content": "WASHINGTON (AP) — Republican Sen. Lindsey Graham said Tuesday that he believes President Donald Trump is prepared to “crush” Russia’s economy with a new wave of sanctions if Russian President Vladimir Putin refuses to meet with Ukrainian President Vo... [3785 chars]",
    "url": "https://www.usnews.com/news/politics/articles/2025-08-19/sen-lindsey-graham-says-trump-ready-to-crush-russian-economy-if-putin-avoids-talks-with-zelenskyy",
    "image": "https://www.usnews.com/dims4/USNEWS/ac01f9d/2147483647/thumbnail/970x647/quality/85/?url=https%3A%2F%2Fwww.usnews.com%2Fcmsmedia%2F22%2F2dd428b60a050fcfc868866f2c1d5c%2F4b7e294b622c45c985fb07e9e13029faElection_2026_Senate_South_Carolina_37374.jpg",
    "publishedAt": "2025-08-19T22:20:00Z",
    "lang": "en",
    "source": {
      "id": "37128a060981dbbe79321f096e7d1108",
      "name": "U.S. News & World Report",
      "url": "https://www.usnews.com",
      "country": "us"
    }
  },
  {
    "id": "500268c898aa89b6a50b7f48395e3f07",
    "title": "What’s Next for the Ukraine Peace Talks?",
    "description": "President Trump says President Vladimir V. Putin of Russia has agreed to meet with President Volodymyr Zelensky of Ukraine, but Mr. Putin has not confirmed.",
    "content": "For all the extraordinary spectacle involved in President Trump’s talks with Russia’s president last week and with Ukraine’s president, accompanied by European leaders, on Monday, the most likely outcome so far is more meetings.\nMr. Trump stressed th... [795 chars]",
    "url": "https://www.nytimes.com/2025/08/19/us/ukraine-peace-talks-trump-putin.html",
    "image": "https://static01.nyt.com/images/2025/08/19/multimedia/19int-putin-trump-whatsnext-mjzt/19int-putin-trump-whatsnext-mjzt-facebookJumbo.jpg",
    "publishedAt": "2025-08-19T22:09:10Z",
    "lang": "en",
    "source": {
      "id": "e553cce06d349ac1f7fbb7618a979256",
      "name": "The New York Times",
      "url": "https://www.nytimes.com",
      "country": "us"
    }
  },
  {
    "id": "8becb1dca4761c2ebcf83a4d96693647",
    "title": "Trump says no ground troops, but maybe air support for Ukraine peace",
    "description": "STORY: :: August 15, 2025U.S. President Donald Trump said on Tuesday that he hoped Russia's Vladimir Putin would move forward on ending the war in Ukraine, a day after Trump met with Ukrainian President Volodymyr Zelenskiy at the White House.But Trump conceded in an interview with the Fox News “Fox & Friends” program that Putin may not want to make a deal at all.Finnish President Alexander Stubb attended the talks in Washington on Monday and said later that Putin is rarely to be trusted, and it remains to be seen if he would come to a trilateral meeting with Trump and Zelenskiy.Olga Tokariuk, Academy Associate at Chatham House Ukraine Forum has similar concerns about whether Putin would meet with Zelenskiy.“Let's see if actually they agree to this meeting between Putin and Zelenskiy, because we know that in the past Putin has been really reluctant to have any meetings with Volodymyr Zelenskiy, because he does not see him as a legitimate leader, as a legitimate president, he does not see Ukraine as a country, a separate sovereign and independent state and a legitimate entity.\"Trump on Tuesday again ruled out American boots on the ground in Ukraine and gave no specifics about the security guarantees he said the U.S. could offer Ukraine under any post-war settlement.A report from Axios said Trump was promising air support. Later, White House Spokesperson Karoline Leavitt was asked about this.\"Look, that was something the president mentioned on his interview this morning. It is an option. It a possibility. I won't certainly rule out anything as far as military options that the president has at his disposal. I'll let him do that. I can tell you he's definitively ruled out boots on the ground.\"Ukraine and its European allies have been buoyed by Trump's promise of security guarantees to help end the war - with Zelenskiy hailing Monday's talks as a \"major step forward\" - but he and the other European leaders face many unanswered questions, including how willing Russia will be to play ball.One issue is whether there will be a ceasefire. Trump said it isn’t a prerequisite for a deal, while European leaders continue to push for it.Moritz Weiss is chair for international relations at Ludwig-Maximilians-University Munich.“What is, of course, really a problem at this stage is: we have no ceasefire. So that means Trump, in a way, succeeded in muddling through this, in a way pointing it away, saying he understands Putin and that he does not want it. So I think this is the critical issue, because of course when one party takes it as a precondition to have a ceasefire and the other one doesn't want it, there will be problems for further talks.”Russia has made no explicit commitment to a meeting between Putin and Zelenskiy. Russian Foreign Minister Sergei Lavrov said on Tuesday that Moscow did not reject any formats for discussing peace in Ukraine but any meeting of national leaders (quote) \"must be prepared with utmost thoroughness.\"With the path to peace still deeply uncertain, Zelenskiy may be forced to make painful compromises to end the war, which began with Russia's full-scale invasion in early 2022. Analysts say more than 1 million people have been killed or wounded in the conflict.",
    "content": "Trump says no ground troops, but maybe air support for Ukraine peace\nSTORY: :: August 15, 2025\nU.S. President Donald Trump said on Tuesday that he hoped Russia's Vladimir Putin would move forward on ending the war in Ukraine, a day after Trump met wi... [3104 chars]",
    "url": "https://sg.news.yahoo.com/trump-says-no-ground-troops-201113155.html",
    "image": "https://media.zenfs.com/en/video.reutersnews.com/500738673196bfc1fed97df8bc583b7c",
    "publishedAt": "2025-08-19T20:11:13Z",
    "lang": "en",
    "source": {
      "id": "f6d6ee1134197fe1441d65a3e7915835",
      "name": "Yahoo Singapore News",
      "url": "https://sg.news.yahoo.com",
      "country": "sg"
    }
  }
]